zephyrproject-rtos/hal_microchip/pic32c/pic32cm_gc_sg/pic32cm_gc00/include/pio/pic32cm5112gc00048.h
/*
 * Peripheral I/O description for PIC32CM5112GC00048
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-11-05T16:47:51Z  */
#ifndef _PIC32CM5112GC00048_GPIO_H_
#define _PIC32CM5112GC00048_GPIO_H_

/* ======================= Peripheral I/O pin numbers ======================= */
#define PIN_PA00                    (    0)  /* Pin Number for PA00 */
#define PIN_PA01                    (    1)  /* Pin Number for PA01 */
#define PIN_PA02                    (    2)  /* Pin Number for PA02 */
#define PIN_PA03                    (    3)  /* Pin Number for PA03 */
#define PIN_PA04                    (    4)  /* Pin Number for PA04 */
#define PIN_PA05                    (    5)  /* Pin Number for PA05 */
#define PIN_PA06                    (    6)  /* Pin Number for PA06 */
#define PIN_PA07                    (    7)  /* Pin Number for PA07 */
#define PIN_PA08                    (    8)  /* Pin Number for PA08 */
#define PIN_PA09                    (    9)  /* Pin Number for PA09 */
#define PIN_PB00                    (   32)  /* Pin Number for PB00 */
#define PIN_PB01                    (   33)  /* Pin Number for PB01 */
#define PIN_PB02                    (   34)  /* Pin Number for PB02 */
#define PIN_PB03                    (   35)  /* Pin Number for PB03 */
#define PIN_PB04                    (   36)  /* Pin Number for PB04 */
#define PIN_PB05                    (   37)  /* Pin Number for PB05 */
#define PIN_PB06                    (   38)  /* Pin Number for PB06 */
#define PIN_PC00                    (   64)  /* Pin Number for PC00 */
#define PIN_PC01                    (   65)  /* Pin Number for PC01 */
#define PIN_PC02                    (   66)  /* Pin Number for PC02 */
#define PIN_PC03                    (   67)  /* Pin Number for PC03 */
#define PIN_PC04                    (   68)  /* Pin Number for PC04 */
#define PIN_PC05                    (   69)  /* Pin Number for PC05 */
#define PIN_PC06                    (   70)  /* Pin Number for PC06 */
#define PIN_PC07                    (   71)  /* Pin Number for PC07 */
#define PIN_PC08                    (   72)  /* Pin Number for PC08 */
#define PIN_PD00                    (   96)  /* Pin Number for PD00 */
#define PIN_PD01                    (   97)  /* Pin Number for PD01 */
#define PIN_PD02                    (   98)  /* Pin Number for PD02 */
#define PIN_PD03                    (   99)  /* Pin Number for PD03 */
#define PIN_PD04                    (  100)  /* Pin Number for PD04 */
#define PIN_PD05                    (  101)  /* Pin Number for PD05 */
#define PIN_PD06                    (  102)  /* Pin Number for PD06 */
#define PIN_PD07                    (  103)  /* Pin Number for PD07 */
#define PIN_PD08                    (  104)  /* Pin Number for PD08 */
#define PIN_PD09                    (  105)  /* Pin Number for PD09 */

/* ========================== Peripheral I/O masks ========================== */
#define PORT_PA00                   (_UINT32_(1) << 0) /* PORT mask for PA00 */
#define PORT_PA01                   (_UINT32_(1) << 1) /* PORT mask for PA01 */
#define PORT_PA02                   (_UINT32_(1) << 2) /* PORT mask for PA02 */
#define PORT_PA03                   (_UINT32_(1) << 3) /* PORT mask for PA03 */
#define PORT_PA04                   (_UINT32_(1) << 4) /* PORT mask for PA04 */
#define PORT_PA05                   (_UINT32_(1) << 5) /* PORT mask for PA05 */
#define PORT_PA06                   (_UINT32_(1) << 6) /* PORT mask for PA06 */
#define PORT_PA07                   (_UINT32_(1) << 7) /* PORT mask for PA07 */
#define PORT_PA08                   (_UINT32_(1) << 8) /* PORT mask for PA08 */
#define PORT_PA09                   (_UINT32_(1) << 9) /* PORT mask for PA09 */
#define PORT_PB00                   (_UINT32_(1) << 0) /* PORT mask for PB00 */
#define PORT_PB01                   (_UINT32_(1) << 1) /* PORT mask for PB01 */
#define PORT_PB02                   (_UINT32_(1) << 2) /* PORT mask for PB02 */
#define PORT_PB03                   (_UINT32_(1) << 3) /* PORT mask for PB03 */
#define PORT_PB04                   (_UINT32_(1) << 4) /* PORT mask for PB04 */
#define PORT_PB05                   (_UINT32_(1) << 5) /* PORT mask for PB05 */
#define PORT_PB06                   (_UINT32_(1) << 6) /* PORT mask for PB06 */
#define PORT_PC00                   (_UINT32_(1) << 0) /* PORT mask for PC00 */
#define PORT_PC01                   (_UINT32_(1) << 1) /* PORT mask for PC01 */
#define PORT_PC02                   (_UINT32_(1) << 2) /* PORT mask for PC02 */
#define PORT_PC03                   (_UINT32_(1) << 3) /* PORT mask for PC03 */
#define PORT_PC04                   (_UINT32_(1) << 4) /* PORT mask for PC04 */
#define PORT_PC05                   (_UINT32_(1) << 5) /* PORT mask for PC05 */
#define PORT_PC06                   (_UINT32_(1) << 6) /* PORT mask for PC06 */
#define PORT_PC07                   (_UINT32_(1) << 7) /* PORT mask for PC07 */
#define PORT_PC08                   (_UINT32_(1) << 8) /* PORT mask for PC08 */
#define PORT_PD00                   (_UINT32_(1) << 0) /* PORT mask for PD00 */
#define PORT_PD01                   (_UINT32_(1) << 1) /* PORT mask for PD01 */
#define PORT_PD02                   (_UINT32_(1) << 2) /* PORT mask for PD02 */
#define PORT_PD03                   (_UINT32_(1) << 3) /* PORT mask for PD03 */
#define PORT_PD04                   (_UINT32_(1) << 4) /* PORT mask for PD04 */
#define PORT_PD05                   (_UINT32_(1) << 5) /* PORT mask for PD05 */
#define PORT_PD06                   (_UINT32_(1) << 6) /* PORT mask for PD06 */
#define PORT_PD07                   (_UINT32_(1) << 7) /* PORT mask for PD07 */
#define PORT_PD08                   (_UINT32_(1) << 8) /* PORT mask for PD08 */
#define PORT_PD09                   (_UINT32_(1) << 9) /* PORT mask for PD09 */

/* =================== PORT definition for AC peripheral ==================== */
#define PIN_PA07B_AC_AIN0                          _UINT32_(7) 
#define MUX_PA07B_AC_AIN0                          _UINT32_(1) 
#define PINMUX_PA07B_AC_AIN0                       ((PIN_PA07B_AC_AIN0 << 16) | MUX_PA07B_AC_AIN0)
#define PORT_PA07B_AC_AIN0                         (_UINT32_(1) << 7)

#define PIN_PA08B_AC_AIN1                          _UINT32_(8) 
#define MUX_PA08B_AC_AIN1                          _UINT32_(1) 
#define PINMUX_PA08B_AC_AIN1                       ((PIN_PA08B_AC_AIN1 << 16) | MUX_PA08B_AC_AIN1)
#define PORT_PA08B_AC_AIN1                         (_UINT32_(1) << 8)

