zephyrproject-rtos/hal_microchip/pic32c/pic32cm_gc_sg/pic32cm_gc00/include/pio/pic32cm5112gc00048.h
#define PIN_PC00P_PTC_DRV19                        _UINT32_(64)
#define MUX_PC00P_PTC_DRV19                        _UINT32_(15)
#define PINMUX_PC00P_PTC_DRV19                     ((PIN_PC00P_PTC_DRV19 << 16) | MUX_PC00P_PTC_DRV19)
#define PORT_PC00P_PTC_DRV19                       (_UINT32_(1) << 0)

#define PIN_PC01P_PTC_DRV20                        _UINT32_(65)
#define MUX_PC01P_PTC_DRV20                        _UINT32_(15)
#define PINMUX_PC01P_PTC_DRV20                     ((PIN_PC01P_PTC_DRV20 << 16) | MUX_PC01P_PTC_DRV20)
#define PORT_PC01P_PTC_DRV20                       (_UINT32_(1) << 1)

#define PIN_PC02P_PTC_DRV21                        _UINT32_(66)
#define MUX_PC02P_PTC_DRV21                        _UINT32_(15)
#define PINMUX_PC02P_PTC_DRV21                     ((PIN_PC02P_PTC_DRV21 << 16) | MUX_PC02P_PTC_DRV21)
#define PORT_PC02P_PTC_DRV21                       (_UINT32_(1) << 2)

#define PIN_PC03P_PTC_ECI0                         _UINT32_(67)
#define MUX_PC03P_PTC_ECI0                         _UINT32_(15)
#define PINMUX_PC03P_PTC_ECI0                      ((PIN_PC03P_PTC_ECI0 << 16) | MUX_PC03P_PTC_ECI0)
#define PORT_PC03P_PTC_ECI0                        (_UINT32_(1) << 3)

#define PIN_PC04P_PTC_ECI1                         _UINT32_(68)
#define MUX_PC04P_PTC_ECI1                         _UINT32_(15)
#define PINMUX_PC04P_PTC_ECI1                      ((PIN_PC04P_PTC_ECI1 << 16) | MUX_PC04P_PTC_ECI1)
#define PORT_PC04P_PTC_ECI1                        (_UINT32_(1) << 4)

#define PIN_PD06P_PTC_PTCXY0                       _UINT32_(102)
#define MUX_PD06P_PTC_PTCXY0                       _UINT32_(15)
#define PINMUX_PD06P_PTC_PTCXY0                    ((PIN_PD06P_PTC_PTCXY0 << 16) | MUX_PD06P_PTC_PTCXY0)
#define PORT_PD06P_PTC_PTCXY0                      (_UINT32_(1) << 6)

#define PIN_PD07P_PTC_PTCXY1                       _UINT32_(103)
#define MUX_PD07P_PTC_PTCXY1                       _UINT32_(15)
#define PINMUX_PD07P_PTC_PTCXY1                    ((PIN_PD07P_PTC_PTCXY1 << 16) | MUX_PD07P_PTC_PTCXY1)
#define PORT_PD07P_PTC_PTCXY1                      (_UINT32_(1) << 7)

#define PIN_PD08P_PTC_PTCXY2                       _UINT32_(104)
#define MUX_PD08P_PTC_PTCXY2                       _UINT32_(15)
#define PINMUX_PD08P_PTC_PTCXY2                    ((PIN_PD08P_PTC_PTCXY2 << 16) | MUX_PD08P_PTC_PTCXY2)
#define PORT_PD08P_PTC_PTCXY2                      (_UINT32_(1) << 8)

#define PIN_PD09P_PTC_PTCXY3                       _UINT32_(105)
#define MUX_PD09P_PTC_PTCXY3                       _UINT32_(15)
#define PINMUX_PD09P_PTC_PTCXY3                    ((PIN_PD09P_PTC_PTCXY3 << 16) | MUX_PD09P_PTC_PTCXY3)
#define PORT_PD09P_PTC_PTCXY3                      (_UINT32_(1) << 9)

#define PIN_PA00P_PTC_PTCXY4                       _UINT32_(0) 
#define MUX_PA00P_PTC_PTCXY4                       _UINT32_(15)
#define PINMUX_PA00P_PTC_PTCXY4                    ((PIN_PA00P_PTC_PTCXY4 << 16) | MUX_PA00P_PTC_PTCXY4)
#define PORT_PA00P_PTC_PTCXY4                      (_UINT32_(1) << 0)

#define PIN_PA01P_PTC_PTCXY5                       _UINT32_(1) 
#define MUX_PA01P_PTC_PTCXY5                       _UINT32_(15)
#define PINMUX_PA01P_PTC_PTCXY5                    ((PIN_PA01P_PTC_PTCXY5 << 16) | MUX_PA01P_PTC_PTCXY5)
#define PORT_PA01P_PTC_PTCXY5                      (_UINT32_(1) << 1)

#define PIN_PA02P_PTC_PTCXY6                       _UINT32_(2) 
#define MUX_PA02P_PTC_PTCXY6                       _UINT32_(15)
#define PINMUX_PA02P_PTC_PTCXY6                    ((PIN_PA02P_PTC_PTCXY6 << 16) | MUX_PA02P_PTC_PTCXY6)
#define PORT_PA02P_PTC_PTCXY6                      (_UINT32_(1) << 2)

#define PIN_PA03P_PTC_PTCXY7                       _UINT32_(3) 
#define MUX_PA03P_PTC_PTCXY7                       _UINT32_(15)
#define PINMUX_PA03P_PTC_PTCXY7                    ((PIN_PA03P_PTC_PTCXY7 << 16) | MUX_PA03P_PTC_PTCXY7)
#define PORT_PA03P_PTC_PTCXY7                      (_UINT32_(1) << 3)

#define PIN_PA04P_PTC_PTCXY8                       _UINT32_(4) 
#define MUX_PA04P_PTC_PTCXY8                       _UINT32_(15)
#define PINMUX_PA04P_PTC_PTCXY8                    ((PIN_PA04P_PTC_PTCXY8 << 16) | MUX_PA04P_PTC_PTCXY8)
#define PORT_PA04P_PTC_PTCXY8                      (_UINT32_(1) << 4)

#define PIN_PA05P_PTC_PTCXY9                       _UINT32_(5) 
#define MUX_PA05P_PTC_PTCXY9                       _UINT32_(15)
#define PINMUX_PA05P_PTC_PTCXY9                    ((PIN_PA05P_PTC_PTCXY9 << 16) | MUX_PA05P_PTC_PTCXY9)
#define PORT_PA05P_PTC_PTCXY9                      (_UINT32_(1) << 5)

#define PIN_PA06P_PTC_PTCXY10                      _UINT32_(6) 
#define MUX_PA06P_PTC_PTCXY10                      _UINT32_(15)
#define PINMUX_PA06P_PTC_PTCXY10                   ((PIN_PA06P_PTC_PTCXY10 << 16) | MUX_PA06P_PTC_PTCXY10)
#define PORT_PA06P_PTC_PTCXY10                     (_UINT32_(1) << 6)

#define PIN_PA07P_PTC_PTCXY11                      _UINT32_(7) 
#define MUX_PA07P_PTC_PTCXY11                      _UINT32_(15)
#define PINMUX_PA07P_PTC_PTCXY11                   ((PIN_PA07P_PTC_PTCXY11 << 16) | MUX_PA07P_PTC_PTCXY11)
#define PORT_PA07P_PTC_PTCXY11                     (_UINT32_(1) << 7)

#define PIN_PA08P_PTC_PTCXY12                      _UINT32_(8) 
#define MUX_PA08P_PTC_PTCXY12                      _UINT32_(15)
#define PINMUX_PA08P_PTC_PTCXY12                   ((PIN_PA08P_PTC_PTCXY12 << 16) | MUX_PA08P_PTC_PTCXY12)
#define PORT_PA08P_PTC_PTCXY12                     (_UINT32_(1) << 8)

#define PIN_PA09P_PTC_PTCXY13                      _UINT32_(9) 
#define MUX_PA09P_PTC_PTCXY13                      _UINT32_(15)
#define PINMUX_PA09P_PTC_PTCXY13                   ((PIN_PA09P_PTC_PTCXY13 << 16) | MUX_PA09P_PTC_PTCXY13)
#define PORT_PA09P_PTC_PTCXY13                     (_UINT32_(1) << 9)

#define PIN_PB00P_PTC_PTCXY14                      _UINT32_(32)
#define MUX_PB00P_PTC_PTCXY14                      _UINT32_(15)
#define PINMUX_PB00P_PTC_PTCXY14                   ((PIN_PB00P_PTC_PTCXY14 << 16) | MUX_PB00P_PTC_PTCXY14)
#define PORT_PB00P_PTC_PTCXY14                     (_UINT32_(1) << 0)

