zephyrproject-rtos/hal_microchip/pic32c/pic32cm_gc_sg/pic32cm_gc00/include/pio/pic32cm5112gc00048.h
#define PIN_PB03P_PTC_PTCXY15                      _UINT32_(35)
#define MUX_PB03P_PTC_PTCXY15                      _UINT32_(15)
#define PINMUX_PB03P_PTC_PTCXY15                   ((PIN_PB03P_PTC_PTCXY15 << 16) | MUX_PB03P_PTC_PTCXY15)
#define PORT_PB03P_PTC_PTCXY15                     (_UINT32_(1) << 3)

#define PIN_PB04P_PTC_PTCXY16                      _UINT32_(36)
#define MUX_PB04P_PTC_PTCXY16                      _UINT32_(15)
#define PINMUX_PB04P_PTC_PTCXY16                   ((PIN_PB04P_PTC_PTCXY16 << 16) | MUX_PB04P_PTC_PTCXY16)
#define PORT_PB04P_PTC_PTCXY16                     (_UINT32_(1) << 4)

#define PIN_PB05P_PTC_PTCXY17                      _UINT32_(37)
#define MUX_PB05P_PTC_PTCXY17                      _UINT32_(15)
#define PINMUX_PB05P_PTC_PTCXY17                   ((PIN_PB05P_PTC_PTCXY17 << 16) | MUX_PB05P_PTC_PTCXY17)
#define PORT_PB05P_PTC_PTCXY17                     (_UINT32_(1) << 5)

#define PIN_PB06P_PTC_PTCXY18                      _UINT32_(38)
#define MUX_PB06P_PTC_PTCXY18                      _UINT32_(15)
#define PINMUX_PB06P_PTC_PTCXY18                   ((PIN_PB06P_PTC_PTCXY18 << 16) | MUX_PB06P_PTC_PTCXY18)
#define PORT_PB06P_PTC_PTCXY18                     (_UINT32_(1) << 6)

#define PIN_PC00P_PTC_PTCXY19                      _UINT32_(64)
#define MUX_PC00P_PTC_PTCXY19                      _UINT32_(15)
#define PINMUX_PC00P_PTC_PTCXY19                   ((PIN_PC00P_PTC_PTCXY19 << 16) | MUX_PC00P_PTC_PTCXY19)
#define PORT_PC00P_PTC_PTCXY19                     (_UINT32_(1) << 0)

#define PIN_PC01P_PTC_PTCXY20                      _UINT32_(65)
#define MUX_PC01P_PTC_PTCXY20                      _UINT32_(15)
#define PINMUX_PC01P_PTC_PTCXY20                   ((PIN_PC01P_PTC_PTCXY20 << 16) | MUX_PC01P_PTC_PTCXY20)
#define PORT_PC01P_PTC_PTCXY20                     (_UINT32_(1) << 1)

#define PIN_PC02P_PTC_PTCXY21                      _UINT32_(66)
#define MUX_PC02P_PTC_PTCXY21                      _UINT32_(15)
#define PINMUX_PC02P_PTC_PTCXY21                   ((PIN_PC02P_PTC_PTCXY21 << 16) | MUX_PC02P_PTC_PTCXY21)
#define PORT_PC02P_PTC_PTCXY21                     (_UINT32_(1) << 2)

/* ================= PORT definition for SERCOM0 peripheral ================= */
#define PIN_PC00D_SERCOM0_PAD0                     _UINT32_(64)
#define MUX_PC00D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PC00D_SERCOM0_PAD0                  ((PIN_PC00D_SERCOM0_PAD0 << 16) | MUX_PC00D_SERCOM0_PAD0)
#define PORT_PC00D_SERCOM0_PAD0                    (_UINT32_(1) << 0)

#define PIN_PC01D_SERCOM0_PAD1                     _UINT32_(65)
#define MUX_PC01D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PC01D_SERCOM0_PAD1                  ((PIN_PC01D_SERCOM0_PAD1 << 16) | MUX_PC01D_SERCOM0_PAD1)
#define PORT_PC01D_SERCOM0_PAD1                    (_UINT32_(1) << 1)

#define PIN_PC02D_SERCOM0_PAD2                     _UINT32_(66)
#define MUX_PC02D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PC02D_SERCOM0_PAD2                  ((PIN_PC02D_SERCOM0_PAD2 << 16) | MUX_PC02D_SERCOM0_PAD2)
#define PORT_PC02D_SERCOM0_PAD2                    (_UINT32_(1) << 2)

#define PIN_PC03D_SERCOM0_PAD3                     _UINT32_(67)
#define MUX_PC03D_SERCOM0_PAD3                     _UINT32_(3) 
#define PINMUX_PC03D_SERCOM0_PAD3                  ((PIN_PC03D_SERCOM0_PAD3 << 16) | MUX_PC03D_SERCOM0_PAD3)
#define PORT_PC03D_SERCOM0_PAD3                    (_UINT32_(1) << 3)

/* ================= PORT definition for SERCOM1 peripheral ================= */
#define PIN_PD01D_SERCOM1_PAD0                     _UINT32_(97)
#define MUX_PD01D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PD01D_SERCOM1_PAD0                  ((PIN_PD01D_SERCOM1_PAD0 << 16) | MUX_PD01D_SERCOM1_PAD0)
#define PORT_PD01D_SERCOM1_PAD0                    (_UINT32_(1) << 1)

#define PIN_PD00D_SERCOM1_PAD1                     _UINT32_(96)
#define MUX_PD00D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PD00D_SERCOM1_PAD1                  ((PIN_PD00D_SERCOM1_PAD1 << 16) | MUX_PD00D_SERCOM1_PAD1)
#define PORT_PD00D_SERCOM1_PAD1                    (_UINT32_(1) << 0)

#define PIN_PC06D_SERCOM1_PAD2                     _UINT32_(70)
#define MUX_PC06D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PC06D_SERCOM1_PAD2                  ((PIN_PC06D_SERCOM1_PAD2 << 16) | MUX_PC06D_SERCOM1_PAD2)
#define PORT_PC06D_SERCOM1_PAD2                    (_UINT32_(1) << 6)

#define PIN_PC05D_SERCOM1_PAD3                     _UINT32_(69)
#define MUX_PC05D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PC05D_SERCOM1_PAD3                  ((PIN_PC05D_SERCOM1_PAD3 << 16) | MUX_PC05D_SERCOM1_PAD3)
#define PORT_PC05D_SERCOM1_PAD3                    (_UINT32_(1) << 5)

/* ================= PORT definition for SERCOM2 peripheral ================= */
#define PIN_PC04D_SERCOM2_PAD0                     _UINT32_(68)
#define MUX_PC04D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PC04D_SERCOM2_PAD0                  ((PIN_PC04D_SERCOM2_PAD0 << 16) | MUX_PC04D_SERCOM2_PAD0)
#define PORT_PC04D_SERCOM2_PAD0                    (_UINT32_(1) << 4)

#define PIN_PD06D_SERCOM2_PAD1                     _UINT32_(102)
#define MUX_PD06D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PD06D_SERCOM2_PAD1                  ((PIN_PD06D_SERCOM2_PAD1 << 16) | MUX_PD06D_SERCOM2_PAD1)
#define PORT_PD06D_SERCOM2_PAD1                    (_UINT32_(1) << 6)

#define PIN_PD07D_SERCOM2_PAD2                     _UINT32_(103)
#define MUX_PD07D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PD07D_SERCOM2_PAD2                  ((PIN_PD07D_SERCOM2_PAD2 << 16) | MUX_PD07D_SERCOM2_PAD2)
#define PORT_PD07D_SERCOM2_PAD2                    (_UINT32_(1) << 7)

#define PIN_PD08D_SERCOM2_PAD3                     _UINT32_(104)
#define MUX_PD08D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PD08D_SERCOM2_PAD3                  ((PIN_PD08D_SERCOM2_PAD3 << 16) | MUX_PD08D_SERCOM2_PAD3)
#define PORT_PD08D_SERCOM2_PAD3                    (_UINT32_(1) << 8)

/* ================= PORT definition for SERCOM3 peripheral ================= */
#define PIN_PD09D_SERCOM3_PAD0                     _UINT32_(105)
#define MUX_PD09D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PD09D_SERCOM3_PAD0                  ((PIN_PD09D_SERCOM3_PAD0 << 16) | MUX_PD09D_SERCOM3_PAD0)
#define PORT_PD09D_SERCOM3_PAD0                    (_UINT32_(1) << 9)

#define PIN_PA00D_SERCOM3_PAD1                     _UINT32_(0) 
#define MUX_PA00D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PA00D_SERCOM3_PAD1                  ((PIN_PA00D_SERCOM3_PAD1 << 16) | MUX_PA00D_SERCOM3_PAD1)
#define PORT_PA00D_SERCOM3_PAD1                    (_UINT32_(1) << 0)

