zephyrproject-rtos/hal_microchip/pic32c/pic32cm_gc_sg/pic32cm_gc00/include/pio/pic32cm5112gc00048.h
#define PIN_PA01D_SERCOM3_PAD2                     _UINT32_(1) 
#define MUX_PA01D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PA01D_SERCOM3_PAD2                  ((PIN_PA01D_SERCOM3_PAD2 << 16) | MUX_PA01D_SERCOM3_PAD2)
#define PORT_PA01D_SERCOM3_PAD2                    (_UINT32_(1) << 1)

#define PIN_PA02D_SERCOM3_PAD3                     _UINT32_(2) 
#define MUX_PA02D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PA02D_SERCOM3_PAD3                  ((PIN_PA02D_SERCOM3_PAD3 << 16) | MUX_PA02D_SERCOM3_PAD3)
#define PORT_PA02D_SERCOM3_PAD3                    (_UINT32_(1) << 2)

/* ================= PORT definition for SERCOM4 peripheral ================= */
#define PIN_PA03D_SERCOM4_PAD0                     _UINT32_(3) 
#define MUX_PA03D_SERCOM4_PAD0                     _UINT32_(3) 
#define PINMUX_PA03D_SERCOM4_PAD0                  ((PIN_PA03D_SERCOM4_PAD0 << 16) | MUX_PA03D_SERCOM4_PAD0)
#define PORT_PA03D_SERCOM4_PAD0                    (_UINT32_(1) << 3)

#define PIN_PA04D_SERCOM4_PAD1                     _UINT32_(4) 
#define MUX_PA04D_SERCOM4_PAD1                     _UINT32_(3) 
#define PINMUX_PA04D_SERCOM4_PAD1                  ((PIN_PA04D_SERCOM4_PAD1 << 16) | MUX_PA04D_SERCOM4_PAD1)
#define PORT_PA04D_SERCOM4_PAD1                    (_UINT32_(1) << 4)

#define PIN_PA05D_SERCOM4_PAD2                     _UINT32_(5) 
#define MUX_PA05D_SERCOM4_PAD2                     _UINT32_(3) 
#define PINMUX_PA05D_SERCOM4_PAD2                  ((PIN_PA05D_SERCOM4_PAD2 << 16) | MUX_PA05D_SERCOM4_PAD2)
#define PORT_PA05D_SERCOM4_PAD2                    (_UINT32_(1) << 5)

#define PIN_PA06D_SERCOM4_PAD3                     _UINT32_(6) 
#define MUX_PA06D_SERCOM4_PAD3                     _UINT32_(3) 
#define PINMUX_PA06D_SERCOM4_PAD3                  ((PIN_PA06D_SERCOM4_PAD3 << 16) | MUX_PA06D_SERCOM4_PAD3)
#define PORT_PA06D_SERCOM4_PAD3                    (_UINT32_(1) << 6)

/* ================= PORT definition for SERCOM5 peripheral ================= */
#define PIN_PB03D_SERCOM5_PAD0                     _UINT32_(35)
#define MUX_PB03D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PB03D_SERCOM5_PAD0                  ((PIN_PB03D_SERCOM5_PAD0 << 16) | MUX_PB03D_SERCOM5_PAD0)
#define PORT_PB03D_SERCOM5_PAD0                    (_UINT32_(1) << 3)

#define PIN_PB04D_SERCOM5_PAD1                     _UINT32_(36)
#define MUX_PB04D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PB04D_SERCOM5_PAD1                  ((PIN_PB04D_SERCOM5_PAD1 << 16) | MUX_PB04D_SERCOM5_PAD1)
#define PORT_PB04D_SERCOM5_PAD1                    (_UINT32_(1) << 4)

#define PIN_PB05D_SERCOM5_PAD2                     _UINT32_(37)
#define MUX_PB05D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PB05D_SERCOM5_PAD2                  ((PIN_PB05D_SERCOM5_PAD2 << 16) | MUX_PB05D_SERCOM5_PAD2)
#define PORT_PB05D_SERCOM5_PAD2                    (_UINT32_(1) << 5)

#define PIN_PB06D_SERCOM5_PAD3                     _UINT32_(38)
#define MUX_PB06D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PB06D_SERCOM5_PAD3                  ((PIN_PB06D_SERCOM5_PAD3 << 16) | MUX_PB06D_SERCOM5_PAD3)
#define PORT_PB06D_SERCOM5_PAD3                    (_UINT32_(1) << 6)

/* ================== PORT definition for TCC0 peripheral =================== */
#define PIN_PC00F_TCC0_WO0                         _UINT32_(64)
#define MUX_PC00F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PC00F_TCC0_WO0                      ((PIN_PC00F_TCC0_WO0 << 16) | MUX_PC00F_TCC0_WO0)
#define PORT_PC00F_TCC0_WO0                        (_UINT32_(1) << 0)

#define PIN_PC01F_TCC0_WO1                         _UINT32_(65)
#define MUX_PC01F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PC01F_TCC0_WO1                      ((PIN_PC01F_TCC0_WO1 << 16) | MUX_PC01F_TCC0_WO1)
#define PORT_PC01F_TCC0_WO1                        (_UINT32_(1) << 1)

/* ================== PORT definition for TCC1 peripheral =================== */
#define PIN_PC02F_TCC1_WO0                         _UINT32_(66)
#define MUX_PC02F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PC02F_TCC1_WO0                      ((PIN_PC02F_TCC1_WO0 << 16) | MUX_PC02F_TCC1_WO0)
#define PORT_PC02F_TCC1_WO0                        (_UINT32_(1) << 2)

#define PIN_PC03F_TCC1_WO1                         _UINT32_(67)
#define MUX_PC03F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PC03F_TCC1_WO1                      ((PIN_PC03F_TCC1_WO1 << 16) | MUX_PC03F_TCC1_WO1)
#define PORT_PC03F_TCC1_WO1                        (_UINT32_(1) << 3)

/* ================== PORT definition for TCC2 peripheral =================== */
#define PIN_PC04F_TCC2_WO0                         _UINT32_(68)
#define MUX_PC04F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PC04F_TCC2_WO0                      ((PIN_PC04F_TCC2_WO0 << 16) | MUX_PC04F_TCC2_WO0)
#define PORT_PC04F_TCC2_WO0                        (_UINT32_(1) << 4)

#define PIN_PC05F_TCC2_WO1                         _UINT32_(69)
#define MUX_PC05F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PC05F_TCC2_WO1                      ((PIN_PC05F_TCC2_WO1 << 16) | MUX_PC05F_TCC2_WO1)
#define PORT_PC05F_TCC2_WO1                        (_UINT32_(1) << 5)

/* ================== PORT definition for TCC3 peripheral =================== */
#define PIN_PD00F_TCC3_WO0                         _UINT32_(96)
#define MUX_PD00F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PD00F_TCC3_WO0                      ((PIN_PD00F_TCC3_WO0 << 16) | MUX_PD00F_TCC3_WO0)
#define PORT_PD00F_TCC3_WO0                        (_UINT32_(1) << 0)

#define PIN_PD01F_TCC3_WO1                         _UINT32_(97)
#define MUX_PD01F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PD01F_TCC3_WO1                      ((PIN_PD01F_TCC3_WO1 << 16) | MUX_PD01F_TCC3_WO1)
#define PORT_PD01F_TCC3_WO1                        (_UINT32_(1) << 1)

/* ================== PORT definition for TCC4 peripheral =================== */
#define PIN_PD07F_TCC4_WO0                         _UINT32_(103)
#define MUX_PD07F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PD07F_TCC4_WO0                      ((PIN_PD07F_TCC4_WO0 << 16) | MUX_PD07F_TCC4_WO0)
#define PORT_PD07F_TCC4_WO0                        (_UINT32_(1) << 7)

#define PIN_PD08F_TCC4_WO1                         _UINT32_(104)
#define MUX_PD08F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PD08F_TCC4_WO1                      ((PIN_PD08F_TCC4_WO1 << 16) | MUX_PD08F_TCC4_WO1)
#define PORT_PD08F_TCC4_WO1                        (_UINT32_(1) << 8)

